Config/Documents/СписаниеЛитературы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеЛитературы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>AccumulationRegister.РезервОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Comment>Текст причины списания для печати в акте</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаСписанияСБухУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Comment>Номер приказа о назначении комиссии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Comment>Дата приказа о назначении комиссии</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьНаХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМОПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резервировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизацииЗаТекущийМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Приложение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКниг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКниг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ДатыПроведенияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыПроведенияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыСОтдельнойДатойПроведения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительПФС</Name>
					<Comment>Руководитель планово-финансовой службы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйИсполнительКадры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыРаспоряженияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРаспоряженияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаБалансе</Name>
					<Comment>Счета 101, 102, 103, 108</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперативныйУчет</Name>
					<Comment>Счета 21</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаХранении</Name>
					<Comment>Счета 02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоВПользование</Name>
					<Comment>Счета 01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВУправление</Name>
					<Comment>Счета 24</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВАренду</Name>
					<Comment>Счета 25</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВПользование</Name>
					<Comment>Счета 26</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВЛичноеПользование</Name>
					<Comment>Счета 27</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/СписаниеЛитературы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы:
// * Материалы - Массив из Строка - имена элементов
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("ОсновноеСредство");
	ИменаРеквизитов.Добавить("ИнвентарныйНомер");
	ИменаРеквизитов.Добавить("КПС");
	Результат.Вставить("ОсновныеСредства", ИменаРеквизитов);
	Возврат Результат;
КонецФункции

#Область Печать

// Добавить данные для печати акта списания литературы ф. 0504144.
// 
// Параметры:
//  ДанныеДляПечати - см. УправлениеПечатьюБГУ.ТаблицаШапкиДляПечатиАктаСписанияЛитературы0504144
//  МассивДокументов - Массив из ДокументСсылка.СписаниеЛитературы
Процедура ДобавитьДанныеДляПечатиАктаСписанияЛитературы0504144(ДанныеДляПечати, МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивДокументов);
	Запрос.Текст = ТекстЗапросаДляПечатиАкта0510144();	

	Результат			= Запрос.ВыполнитьПакет();
	ВыборкаШапка		= Результат[0].Выбрать(ОбходРезультатаЗапроса.Прямой);
	ВыборкаОС			= Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПриложение	= Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия		= Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСчета		= Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		НоваяСтрокаДокумента = ДанныеДляПечати.Добавить();
		НоваяСтрокаДокумента.СписокЛитературы = УправлениеПечатьюБГУ.ТаблицаСписокДляПечатиАктаСписанияЛитературы0504144();
		НоваяСтрокаДокумента.Комиссия = УправлениеПечатьюБГУ.ТаблицаКомиссияДляПечатиАктаСписанияЛитературы0504144();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, ВыборкаШапка);
		
		Руководитель = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ВыборкаШапка.Организация,
			Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаШапка.Дата);
		НоваяСтрокаДокумента.ОргДиректор = Справочники.Сотрудники.ФамилияИО(Руководитель.ОтветственноеЛицоСсылка, Истина, ВыборкаШапка.Дата);
		
		ВыборкаКомиссия.Сбросить();
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
		Если ВыборкаКомиссия.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаКомиссияТекДок = ВыборкаКомиссия.Выбрать();
		Иначе
			ВыборкаКомиссияТекДок = Неопределено;
		КонецЕсли;
		Если ВыборкаКомиссияТекДок <> Неопределено Тогда
			ВыборкаКомиссияТекДок.Сбросить();
			Пока ВыборкаКомиссияТекДок.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента.Комиссия.Добавить(), ВыборкаКомиссияТекДок);
			КонецЦикла;
		КонецЕсли;

		ВыборкаОСТекДок = Неопределено;
		ВыборкаОС.Сбросить();
		Если ВыборкаОС.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
			ВыборкаОСТекДок = ВыборкаОС.Выбрать();
			Пока ВыборкаОСТекДок.Следующий() Цикл
				НоваяСтрокаДокумента.СуммаИтого = НоваяСтрокаДокумента.СуммаИтого + ВыборкаОСТекДок.Сумма;
				НоваяСтрокаДокумента.КоличествоИтого = НоваяСтрокаДокумента.КоличествоИтого + ВыборкаОСТекДок.Количество;
			КонецЦикла;
		КонецЕсли;
		
		СпСчетовДт = Новый Массив;
		СпСчетовКт = Новый Массив;
		ВыборкаСчета.Сбросить();
		Если ВыборкаСчета.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
			ВыборкаСчетаТекДок = ВыборкаСчета.Выбрать();
			Пока ВыборкаСчетаТекДок.Следующий() Цикл
				СпСчетовДт.Добавить(УправлениеПечатьюБГУ.ПредставлениеСчета(ВыборкаСчетаТекДок, "Дт"));
				СпСчетовКт.Добавить(УправлениеПечатьюБГУ.ПредставлениеСчета(ВыборкаСчетаТекДок, "Кт"));
			КонецЦикла;
		КонецЕсли;
		СпСчетовДт	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(СпСчетовДт);
		СпСчетовКт	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(СпСчетовКт);
		НоваяСтрокаДокумента.СчетДебета	 = СтрСоединить(СпСчетовДт, Символы.ПС);
		НоваяСтрокаДокумента.СчетКредита = СтрСоединить(СпСчетовКт, Символы.ПС);
		
		НоваяСтрокаДокумента.ПричинаСписания	= ВыборкаШапка.ПричинаСписания;
		
		ВыборкаЛитература = Неопределено;
		ВыборкаПриложение.Сбросить();
		Если ВыборкаПриложение.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
			ВыборкаЛитература = ВыборкаПриложение.Выбрать();
		ИначеЕсли ВыборкаОСТекДок<>Неопределено Тогда
			ВыборкаОСТекДок.Сбросить();
			ВыборкаЛитература = ВыборкаОСТекДок;
		КонецЕсли;
		
		Если ВыборкаЛитература<>Неопределено Тогда
			Пока ВыборкаЛитература.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента.СписокЛитературы.Добавить(), ВыборкаЛитература);
			КонецЦикла; 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументСсылка, "ПринятьНаХранение, Номер, Резервировать");
		
	Если РеквизитыДокумента.Резервировать Тогда
		Возврат;
	КонецЕсли;	
	
	НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, РеквизитыДокумента.Номер);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента"	, НСтр("ru = 'Акт списания библиотечного фонда'"));
	Запрос.УстановитьПараметр("НомерДокумента"	, НомерДокумента);
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТаблицаОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизацииЗаТекущийМесяц,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	&НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.ПричинаСписания КАК ПричинаСписания,
	|	ТаблицаОсновныеСредства.Ссылка.ПринятьНаХранение КАК ПринятьНаХранение
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.СписаниеЛитературы.ОсновныеСредства КАК ТаблицаОсновныеСредства 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ТаблицаОсновныеСредства.Ссылка)
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|	И НЕ ТаблицаОсновныеСредства.ПринятьНаХранение
	|";
	
	// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления();
	Если РеквизитыДокумента.ПринятьНаХранение Тогда
		ПараметрыСписания.ВидРаспоряженияУКонтрагента	= Перечисления.ВидыРаспоряженияОС.НаХранении;
		ПараметрыСписания.ПоступлениеКонтрагенту		= Истина;
	КонецЕсли;
	УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
		ДокументСсылка, ПараметрыСписания);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СписаниеЛитературы";
	КомандаПечати.Идентификатор		= "ф0504144_52н";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о списании литературы (ф. 0504144) (52н)'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СписаниеЛитературы";
	КомандаПечати.Идентификатор		= "ф0504144";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Акт о списании литературы (ф. 0504144) (173н)'");
	КомандаПечати.Порядок			= 101;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ф0504144") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ф0504144", "Акт о списании исключенных объектов библиотечного фонда",
			УправлениеПечатьюБГУ.НапечататьАктСписанияЛитературы0504144(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктСписанияЛитературы_0504144"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ф0504144_52н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ф0504144_52н", "Акт о списании исключенных объектов библиотечного фонда",
			УправлениеПечатьюБГУ.НапечататьАктСписанияЛитературы0504144(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктСписанияЛитературы_0504144_52н"));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаДляПечатиАкта0510144()
	Возврат
	"ВЫБРАТЬ
	|	СписаниеЛитературы.Ссылка КАК Ссылка,
	|	СписаниеЛитературы.Номер КАК Номер,
	|	СписаниеЛитературы.Дата КАК Дата,
	|	СписаниеЛитературы.Организация КАК Организация,
	|	СписаниеЛитературы.ИФО КАК ИФО,
	|	ВЫБОР
	|		КОГДА СписаниеЛитературы.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(СписаниеЛитературы.Подразделение)
	|		ИНАЧЕ СписаниеЛитературы.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК Подразделение,
	|	СписаниеЛитературы.Организация.ИНН КАК ИНН,
	|	ВЫБОР
	|		КОГДА СписаниеЛитературы.Подразделение.ОбособленноеПодразделение
	|			ТОГДА СписаниеЛитературы.Подразделение.РегистрацияВНалоговомОргане.КПП
	|		ИНАЧЕ СписаниеЛитературы.Организация.КПП
	|	КОНЕЦ КАК КПП,
	|	СписаниеЛитературы.ЦМО КАК ЦМО,
	|	ПОДСТРОКА(СписаниеЛитературы.ОснованиеДляАкта, 1, 100) КАК ОснованиеДляАкта,
	|	СписаниеЛитературы.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	СписаниеЛитературы.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	СписаниеЛитературы.КФО КАК КФО,
	|	СписаниеЛитературы.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	СписаниеЛитературы.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	СписаниеЛитературы.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	СписаниеЛитературы.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА СписаниеЛитературы.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК ДатаСписанияСБухУчета,
	|	СписаниеЛитературы.Организация.НаименованиеПолное КАК ОргНазв,
	|	СписаниеЛитературы.Организация.КодОКПО КАК КодОКПО,
	|	СписаниеЛитературы.НомерПриказа КАК НомерПриказа,
	|	ВЫБОР
	|		КОГДА СписаниеЛитературы.ДатаПриказа = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ СписаниеЛитературы.ДатаПриказа
	|	КОНЕЦ КАК ДатаПриказа,
	|	СписаниеЛитературы.ПричинаСписания КАК ПричинаСписания
	|ИЗ
	|	Документ.СписаниеЛитературы КАК СписаниеЛитературы 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = СписаниеЛитературы.Ссылка)
	|ГДЕ
	|	СписаниеЛитературы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписаниеЛитературыОсновныеСредства.Ссылка КАК Ссылка,
	|	СписаниеЛитературыОсновныеСредства.НомерСтроки КАК Ном,
	|	ПРЕДСТАВЛЕНИЕ(СписаниеЛитературыОсновныеСредства.ОсновноеСредство) КАК Название,
	|	СписаниеЛитературыОсновныеСредства.Сумма КАК Сумма,
	|	СписаниеЛитературыОсновныеСредства.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА СписаниеЛитературыОсновныеСредства.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ СписаниеЛитературыОсновныеСредства.Сумма / СписаниеЛитературыОсновныеСредства.Количество
	|	КОНЕЦ КАК Цена,
	|	"""" КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.СписаниеЛитературы.ОсновныеСредства КАК СписаниеЛитературыОсновныеСредства
	|ГДЕ
	|	СписаниеЛитературыОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеЛитературыПриложение.Ссылка КАК Ссылка,
	|	СписаниеЛитературыПриложение.НомерСтроки КАК Ном,
	|	СписаниеЛитературыПриложение.Название КАК Название,
	|	СписаниеЛитературыПриложение.КоличествоКниг КАК Количество,
	|	СписаниеЛитературыПриложение.Цена КАК Цена,
	|	СписаниеЛитературыПриложение.СуммаКниг КАК Сумма,
	|	СписаниеЛитературыПриложение.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СписаниеЛитературыПриложение.Коэффициент КАК Коэффициент
	|ИЗ
	|	Документ.СписаниеЛитературы.Приложение КАК СписаниеЛитературыПриложение
	|ГДЕ
	|	СписаниеЛитературыПриложение.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеЛитературыСоставКомиссии.Ссылка КАК Ссылка,
	|	СписаниеЛитературыСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СписаниеЛитературыСоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	СписаниеЛитературыСоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	СписаниеЛитературыСоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	СписаниеЛитературыСоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.СписаниеЛитературы.СоставКомиссии КАК СписаниеЛитературыСоставКомиссии
	|ГДЕ
	|	СписаниеЛитературыСоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУ.Регистратор КАК Ссылка,
	|	ЖурналПроводокЕПСБУ.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУ.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУ.КЭКДт КАК КЭКДт,
	|	"""" КАК КПСДт,
	|	ЖурналПроводокЕПСБУ.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУ.КЭККт КАК КЭККт,
	|	"""" КАК КПСКт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
	|ГДЕ
	|	ЖурналПроводокЕПСБУ.Регистратор В(&МассивОбъектов)
	|	И ЖурналПроводокЕПСБУ.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|	И ЖурналПроводокЕПСБУ.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|ИТОГИ ПО
	|	Ссылка";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
